#include <stdio.h>
#include <locale.h> 


void zadanie1()
{

	printf("123\n"); // подзадание 1
	puts(" ");

	//2 -добавьте в программу управляющие символы, чтобы каждая цифра выводилась на отдельной строке
	printf("1\n2\n3\n");
	puts(" ");

	//3 -добавьте горизонтальную табуляцию перед выводом текста, чтобы цифры выводились "ступеньками" (не друг под другом)
	printf("1\n \t2\n \t \t3\n");
	puts(" ");

	//4 -введите числа, как параметры, используя спецификатор формата %d (установите разную ширину поля вывода так, чтобы получились "ступеньки")
	printf("% d\n % d\n  % d\n   % d\n", 1, 2, 3, 4);
	puts(" ");

	//5 - напечатайте:
	printf("%10.3f\n ", 12.234657);
	puts(" ");

	//6 - измените предшествующую строку так, чтобы число выводилось с точностью - 5 цифр после запятой
	printf("%10.5f\n ", 12.234657);
	puts(" ");

	//7 - напечатайте:
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);
	puts(" ");

	//8- деление 7 на 5 
	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);
	puts(" ");

	//9- умножение 2000 на 4  
	printf("Умножение %d на %d равно %d\n ", 2000, 4, 2000 * 4);
	puts(" ");

	//10 -запишите:
	printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000);
	printf("заменить все на d: %d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000);
	printf("заменить все на f: %f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000);
	printf("заменить все на g: %g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000);
	printf("заменить все на e: %e разделить %e равно %e\n ", 5., 2000000., 5. / 2000000);
	puts(" ");
	return 0;
}

void zadanie2()
{
	int N = 15; //часы
	int K = 46; //минуты

	printf("Сейчас %u часов %u минут 00 секунд\n", N, K);
	printf("Идет %u минута суток\n", N * 60 + K);
	printf("До полуночи осталось %u часов и %u минут\n", 24 - N, 60 - K);
	printf("С 8.00 прошло %u секунд\n", ((N - 8) * 3600) + (K * 60));
	printf("Текущий час  = %1.2f суток  и текущая минута = %1.2f часа", N / (24 * 1.0), K / (60 * 1.0)); //выводом 2 цифр в дробной части
	puts(" ");
	return 0;
}

void zadanie3()
{
	int n = 2;
	int L = 331;
	int k = 3;
	int m = 3;
	printf("Вариант 4\n");
	printf("Дано:\n \t%d\n \t%d\n \t____\n", n, L);
	printf("Ответ:\t%0+*.*f\n", k + m + 2, m, n / (L * 1.0));
	puts(" ");
	return 0;
}


int main() {
	setlocale(LC_CTYPE, "RUS");
	zadanie1();
	zadanie2();
	zadanie3();
	return 0;
}